app/controllers/users_api_controller.rb

    def index
        users = UserApi.all
        if users.empty?
---
SELECT "user_apis".* FROM "user_apis"
SELECT 1 AS one FROM "user_apis" LIMIT ?  [["LIMIT", 1]]

    def typehead
        search = params[:search].to_s
        users = UserApi.where("email like ? OR first_name like ? OR last_name like ?","%#{search}%","%#{search}%","%#{search}%")
        if users.empty?
---
SELECT "user_apis".* FROM "user_apis" WHERE (email like '%appviewx%' OR first_name like '%appviewx%' OR last_name like '%appviewx%')
SELECT "user_apis".* FROM "user_apis" WHERE (first_name like 'karan' OR last_name like 'karan' OR email like 'karan')
SELECT 1 AS one FROM "user_apis" WHERE (email like '%appviewx%' OR first_name like '%appviewx%' OR last_name like '%appviewx%') LIMIT ?  [["LIMIT", 1]]

    def create
        user = UserApi.create(user_params)
        if user.save
---
INSERT INTO "user_apis" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Vishal"], ["last_name", "MC"], ["email", "vishal@gmail.com"], ["created_at", "2023-03-18 07:53:31.371086"], ["updated_at", "2023-03-18 07:53:31.371086"]]
UPDATE "user_apis" SET "first_name" = ?, "updated_at" = ? WHERE "user_apis"."id" = ?  [["first_name", "Vishal"], ["updated_at", "2023-03-18 08:09:02.780548"], ["id", 6]]

    def set_user
        user = UserApi.find_by(id: params[:id])
---
SELECT "user_apis".* FROM "user_apis" WHERE "user_apis"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]